# UpperLimit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Room..::..UpperLimit Property
Room Class See Also
---
Get or Set the Upper Limit of the Room.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Level UpperLimit { get; set; }
```

Visual Basic
---
```text
Public Property UpperLimit As Level
	Get
	Set
```

Visual C++
---
```text
public:
property Level^ UpperLimit {
	Level^ get ();
	void set (Level^ value);
}
```

# Remarks
This property is used to get or set the Upper Limit of the Room.
# See Also
Room Class
Autodesk.Revit.DB.Architecture Namespace